dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
#include "w801duino.h"						//we use w801duino

//gpio
//declare pins
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//SO MAKE SURE THAT THE PINS YOU PICKED ACTUALLY EXIST FOR YOUR PACKAGE
//Pin  0.. 7 -> GPIOA
//Pin  8..15 -> GPIOB
const PIN2GPIO GPIO_PinDef[]= {
#if defined(GPIOA)
	{GPIOA, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOA, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOA, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOA, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOA, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOA, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOA, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOA, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOA, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOA, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOA, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOA, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOA, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOA, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOA, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOA, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOA, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOA, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOA, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOA, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOA, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOA, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOA, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOA, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOA, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOA, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOA, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOA, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOA, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOA, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOA, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOA, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOA

#if defined(GPIOB)
	{GPIOB, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOB, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOB, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOB, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOB, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOB, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOB, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOB, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOB, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOB, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOB, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOB, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOB, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOB, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOB, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOB, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOB, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOB, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOB, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOB, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOB, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOB, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOB, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOB, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOB, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOB, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOB, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOB, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOB, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOB, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOB, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOB, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOB

#if defined(GPIOC)
	{GPIOC, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOC, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOC, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOC, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOC, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOC, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOC, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOC, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOC, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOC, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOC, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOC, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOC, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOC, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOC, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOC, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOC, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOC, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOC, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOC, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOC, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOC, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOC, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOC, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOC, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOC, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOC, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOC, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOC, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOC, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOC, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOC, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOC

