dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
#if defined(GPIOD)							//pins 48..63
	{GPIOD, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOD, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOD, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOD, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOD, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOD, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOD, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOD, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOD, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOD, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOD, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOD, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOD, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOD, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOD, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOD, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOD, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOD, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOD, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOD, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOD, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOD, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOD, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOD, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOD, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOD, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOD, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOD, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOD, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOD, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOD, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOD, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOD

#if defined(GPIOE)							//pins 64..79
	{GPIOE, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOE, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOE, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOE, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOE, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOE, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOE, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOE, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOE, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOE, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOE, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOE, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOE, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOE, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOE, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOE, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOE, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOE, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOE, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOE, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOE, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOE, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOE, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOE, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOE, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOE, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOE, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOE, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOE, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOE, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOE, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOE, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOE

#if defined(GPIOF)							//pins 80..96
	{GPIOF, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOF, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOF, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOF, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOF, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOF, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOF, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOF, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOF, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOF, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOF, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOF, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOF, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOF, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOF, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOF, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOF, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOF, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOF, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOF, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOF, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOF, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOF, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOF, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOF, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOF, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOF, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOF, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOF, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOF, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOF, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOF, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOF

#if defined(GPIOG)							//pins 80..96
	{GPIOG, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOG, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOG, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOG, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOG, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOG, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOG, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOG, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOG, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOG, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOG, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOG, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOG, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOG, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOG, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOG, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOG, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOG, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOG, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOG, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOG, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOG, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOG, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOG, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOG, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOG, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOG, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOG, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOG, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOG, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOG, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOG, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOG

#if defined(GPIOH)
	{GPIOH, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOH, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOH, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOH, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOH, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOH, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOH, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOH, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOH, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOH, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOH, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOH, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOH, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOH, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOH, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOH, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{GPIOH, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{GPIOH, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{GPIOH, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{GPIOH, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{GPIOH, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{GPIOH, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{GPIOH, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{GPIOH, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{GPIOH, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{GPIOH, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{GPIOH, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{GPIOH, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{GPIOH, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{GPIOH, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{GPIOH, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{GPIOH, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//GPIOH
};
//end gpio

//system core clocks
struct {
	__IOM uint32_t cpu;						//F_CPU=F_AHB bus 1
	__IOM uint32_t wlan;					//F_WLAN
	__IOM uint32_t apb;						//F_APB
	__IOM uint32_t peri;					//peripheral clock - not used / updated
} CoreClock;

//sets and update system clocks (F_CPU, F_WLAN and F_APB)
//void tls_sys_clk_set(uint32_t clk) {
uint32_t SystemCoreClockConfig(uint32_t clk) {
	SystemClock_Config(clk);
	
	//should wait for the system to clear bit 31?
	//IO_SET(RCC->CLK_DIV, 1<<31); 						//start the clock update process
	while (RCC->CLK_DIV & (1<<31)) continue;			//wait for bit 31 to clear
	return SystemCoreClockUpdate();	//update system core clocks
	//return;
}

/**
 * @brief          	This function is used to get cpu clock
 *
 * @param[out]     *sysclk	point to the addr for system clk output
 *
 * @return         	None
 *
 * @note           	None
 */
//modified from wm_cpu.c
//void tls_sys_clk_get(tls_sys_clk *sysclk) {
uint32_t SystemCoreClockUpdate(void) {
#ifndef TLS_CONFIG_FPGA
	//clk_div_reg clk_div;
	uint32_t clk;

	//clk_div.w = tls_reg_read32(HR_CLK_DIV_CTL);
	clk=RCC->CLK_DIV;
	//sysclk->cpuclk = W800_PLL_CLK_MHZ/(clk_div.b.CPU);
	CoreClock.cpu = F_PLL / ((clk>>0) & 0xff);
	//sysclk->wlanclk = W800_PLL_CLK_MHZ/(clk_div.b.WLAN);
	CoreClock.wlan= F_PLL / ((clk>>8) & 0xff);
	//sysclk->apbclk = sysclk->cpuclk / clk_div.b.BUS2;
	CoreClock.apb = CoreClock.cpu / ((clk>>16) & 0xff);
	//CoreClock.peri= F_PLL / ((clk>>24) & 0x0f);
#else
	CoreClock.apb =				//sysclk->apbclk =
	CoreClock.cpu =				//sysclk->cpuclk =
	CoreClock.wlan= 40000000ul;	//sysclk->wlanclk = 40;	//MHz
#endif
	return CoreClock.cpu;		//returns F_CPU
}

uint32_t SystemCoreClock(void) {
	return CoreClock.cpu;
}

uint32_t WLANClock(void) {
	return CoreClock.wlan;
}

uint32_t APBClock(void) {
	return CoreClock.apb;
}
//systicks
//systick isr
//for time base off SysTick (24-bit counter)
volatile uint32_t systick_ovf = 1ul<<24;						//time base on Systick -> SysTick->VAL being the lowest 24-bits (SysTick is a downcounter)
static void (* _systick_isrptr)(void)=empty_handler;			//systick_ptr pointing to empty_handler by default

//systick handler - to provide time base for millis()/micros()
#define readl(addr) ({unsigned int __v = (*(volatile unsigned int *) (addr)); __v;})
void ISR CORET_IRQHandler(void) {
	//clear the flag
    //readl(0xE000E010);
	//(*(volatile unsigned int *) (0xE000E010));
	CORET->CTRL;										//read it clears bit 16
#if defined(USE_HALTICK)
	HAL_IncTick();										//so hal tick functions work
#else
	systick_ovf += SysTick_PR;							//increment systick counter - 24bit, 1:1 prescaler
#endif
	_systick_isrptr();									//execute user handler
}

