dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//install systick isr
//activate the isr handler
void systickAttachISR(void (*isrptr)(void)) {
	_systick_isrptr = isrptr;
	//systick isr always on -> not needed
	//NVIC_SetPriority(SYS_TICK_IRQn, -1);				//set the priority
	//NVIC_EnableIRQ(SYS_TICK_IRQn);					//enable the irq
}

//return timer clicks
//execution time = 30 ticks, no optimization
uint32_t systicks(void) {
#if defined(USE_HALTICK)
	return HAL_GetTick();
#else
	volatile uint32_t m;
	volatile uint32_t f;

	//do a double read
	do {
		m = systick_ovf;								//read the overflow counter
		f = CORET->VAL;									//read the least significant 16-bits
	}
	while (m != systick_ovf);							//guard against overflow

	return (m - f) << 0;								//systick is a 24-bit downcounter
#endif
}

//delay ticks
void delayTks(uint32_t tks) {
	uint32_t start_time = ticks();
	while (ticks() - start_time < tks) continue;
}

//reset the mcu
void mcuInit(void) {

	//configure clock gating
	//tmp = REG_GET(HR_CLK_GATE_EN);			//tls_reg_read32(HR_CLK_GATE_EN);		//read clk_gate_en
	//tls_reg_write32(HR_CLK_GATE_EN, 0);		//0->disable clock for all
	//tls_reg_write32(HR_CLK_GATE_EN, 1<<11);	//1->enable clock, bit 11=gpio, 11=timer, 6..1=uart5..0
	RCC->CLK_EN = 	(0<< 9) |					//1->enable rf (bit 9). manual says not to change this. default is 1 -> changing it to 0 works as well
					(1<<11) |					//1->enable clock, bit 11=gpio, 10=timer, 6..1=uart5..0
					0x00;

	//configure systick/coretimer
	//a down counter

	//update systemcoreclock
	SystemCoreClockConfig(CPU_CLK);				//set clocks and updates clocks
	//SystemCoreClockUpdate();
#if defined(USE_HALTICK)
	HAL_Init();
#else
	//reconfigure systick / coretimer
	_systick_isrptr = empty_handler;			//point to the empty handler / do nothing
	systick_ovf = SysTick_PR;					//reset systick_ovf to its initial value -> 24bit downcounter
	//SysTick_Config(0);						//tops at 0xfffffful -> free running
    CORET->LOAD  = SysTick_PR-1;				/* set reload register */
    CORET->VAL   = 0UL;							/* Load the CORET Counter Value */
    CORET->CTRL  = CORET_CTRL_CLKSOURCE_Msk |
                   CORET_CTRL_TICKINT_Msk |
                   CORET_CTRL_ENABLE_Msk;		/* Enable CORET IRQ and CORET Timer */
#endif	//use_haltick

	NVIC_ClearPendingIRQ(SYS_TICK_IRQn);		//clear pend flag
	//NVIC_SetPriority(SYS_TICK_IRQn, -1);		//set the priority
	NVIC_EnableIRQ(SYS_TICK_IRQn);				//enable the irq

	//ei();										//enable interrupts - do nothing actually
}

//arduino functions

//empty interrupt handler
void empty_handler(void) {
	//do nothing here
}

//C main loop
int main(void) {

	mcuInit();									//reset the mcu
	setup();									//run the setup code
	while (1) {
		loop();									//run the default loop
	}
}

//arduino gpio
//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	if (mode==OUTPUT) GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//set / clear a pin
inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
#if defined(USE_HALGPIO)
	HAL_GPIO_WritePin(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, (val==HIGH)?GPIO_PIN_SET:GPIO_PIN_RESET);
#else			//baremetal
	if (val==LOW) GIO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else GIO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
#endif			//use_halgpio
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
#if defined(USE_HALGPIO)
	return (HAL_GPIO_ReadPin(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
#else
	return (GIO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
#endif			//use_halgpio
}

//enable pull-up
//use PULLUP or !PULLUP
//set PULLUP_EN to disable pullup, clear pullup_en to enable pullup
inline void pinPullup(PIN_TypeDef pin, uint8_t en) {
	if (en) IO_CLR(GPIO_PinDef[pin].gpio->PULLUP_EN, GPIO_PinDef[pin].mask);				//0->enable pull up
	else IO_SET(GPIO_PinDef[pin].gpio->PULLUP_EN, GPIO_PinDef[pin].mask);
}

//enable pull-down
//use PULLDOWN or !PULLDOWN
//set pulldown_en to enable pulldown, clear PULLDOWN_EN to disable pulldown
inline void pinPulldown(PIN_TypeDef pin, uint8_t en) {
	if (en) IO_SET(GPIO_PinDef[pin].gpio->PULLDOWN_EN, GPIO_PinDef[pin].mask);				//1->enable pull down
	else IO_CLR(GPIO_PinDef[pin].gpio->PULLDOWN_EN, GPIO_PinDef[pin].mask);
}

//enable alternative functions
//af=0..3, for af option 0..3
//deprecated
inline void pinAFIO_(PIN_TypeDef pin, uint8_t af) {
	//configure af_s1 and af_s0
	if (af & (1<<1)) IO_SET(GPIO_PinDef[pin].gpio->AF_S1, GPIO_PinDef[pin].mask); else IO_CLR(GPIO_PinDef[pin].gpio->AF_S1, GPIO_PinDef[pin].mask);	//1->enable af_s1
	if (af & (1<<0)) IO_SET(GPIO_PinDef[pin].gpio->AF_S0, GPIO_PinDef[pin].mask); else IO_CLR(GPIO_PinDef[pin].gpio->AF_S0, GPIO_PinDef[pin].mask);	//1->enable af_s0
	IO_SET(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);	//1->enable af
}

//enable alternative functions for touch
//deprecated
inline void pinTouch(PIN_TypeDef pin) {
	//configure af_s1 and af_s0
	IO_CLR(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);	//1->enable af, 0->gpio
	IO_CLR(GPIO_PinDef[pin].gpio->DIR, GPIO_PinDef[pin].mask);		//1->output, 0->input
	IO_SET(GPIO_PinDef[pin].gpio->PULLUP_EN, GPIO_PinDef[pin].mask);		//set PULLUP_EN to disable pullup, clear pullup_en to enable pullup
	IO_CLR(GPIO_PinDef[pin].gpio->PULLDOWN_EN, GPIO_PinDef[pin].mask);		//set pulldown_en to enable pulldown, clear PULLDOWN_EN to disable pulldown
}

//enable alternative functions, option 1..7, as with the sdk
inline void pinAFIO(PIN_TypeDef pin, uint8_t opt) {
	switch (opt) {
		case 1:
			//af mode 0
			IO_SET(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			IO_CLR(GPIO_PinDef[pin].gpio->AF_S1 , GPIO_PinDef[pin].mask);
			IO_CLR(GPIO_PinDef[pin].gpio->AF_S0 , GPIO_PinDef[pin].mask);
			break;
		case 2:
			//af mode 1
			IO_SET(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			IO_CLR(GPIO_PinDef[pin].gpio->AF_S1 , GPIO_PinDef[pin].mask);
			IO_SET(GPIO_PinDef[pin].gpio->AF_S0 , GPIO_PinDef[pin].mask);
			break;
		case 3:
			//af mode 2
			IO_SET(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			IO_SET(GPIO_PinDef[pin].gpio->AF_S1 , GPIO_PinDef[pin].mask);
			IO_CLR(GPIO_PinDef[pin].gpio->AF_S0 , GPIO_PinDef[pin].mask);
			break;
		case 4:
			//af mode 3
			IO_SET(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			IO_SET(GPIO_PinDef[pin].gpio->AF_S1 , GPIO_PinDef[pin].mask);
			IO_SET(GPIO_PinDef[pin].gpio->AF_S0 , GPIO_PinDef[pin].mask);
			break;
		case 5:
			//gpio,
			IO_CLR(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			//IO_CLR(GPIO_PinDef[pin].gpio->AF_S1 , GPIO_PinDef[pin].mask);
			//IO_CLR(GPIO_PinDef[pin].gpio->AF_S2 , GPIO_PinDef[pin].mask);
			break;
		case 6:
			//gpio, floating input, disable both pull-down / pullup (???)
			//for adc
			IO_CLR(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			IO_CLR(GPIO_PinDef[pin].gpio->DIR   , GPIO_PinDef[pin].mask);		//1->output, 0->input
			IO_SET(GPIO_PinDef[pin].gpio->PULLUP_EN , GPIO_PinDef[pin].mask);	//1->disable pullup, 0->enable pullup
			IO_CLR(GPIO_PinDef[pin].gpio->PULLDOWN_EN, GPIO_PinDef[pin].mask);	//1->enable pulldown, 0->>disable pulldown
			break;
		case 7:
			//gpio, floating input, disable both pull-down / pull-up (??? identical to opt 6)
			//for touch
			IO_CLR(GPIO_PinDef[pin].gpio->AF_SEL, GPIO_PinDef[pin].mask);		//1->af, 0->gpio
			IO_CLR(GPIO_PinDef[pin].gpio->DIR   , GPIO_PinDef[pin].mask);		//1->output, 0->input
			IO_SET(GPIO_PinDef[pin].gpio->PULLUP_EN , GPIO_PinDef[pin].mask);	//1->disable pullup, 0->enable pullup
			IO_CLR(GPIO_PinDef[pin].gpio->PULLDOWN_EN, GPIO_PinDef[pin].mask);	//1->enable pulldown, 0->disable pulldown
			break;
		default: break;
	}
}

//gpioa isr
static void (* _gpioa_isrptr)(void)=empty_handler;				//tmr_ptr pointing to empty_handler by default

//gpioa isr
void ISR GPIOA_IRQHandler(void) {
	_gpioa_isrptr();						//execute user isr - it has to clear its own flags
	//optional
	//GPIOA->IC = GPIOA->IC;				//write 1 to clear
}

//default setting
void GPIOAAttachISR(void (*isrptr)(void), PIN_TypeDef pin, uint8_t mode) {
	uint32_t tmp=1ul<<(pin-PA0);			//pin
	_gpioa_isrptr = isrptr;					//install user handler

	//configure triggering mode
	//IO_CLR(GPIOA->IS, tmp);				//1->level triggered, 0->edge triggered
	//IO_CLR(GPIOA->IBE, tmp);				//1->both edge triggered, 0->single edge triggered (see IEV)
	//IO_CLR(GPIOA->IEV, tmp);				//1->triggered by high level / rising edge, 0->triggered by low level / falling edge
	switch (mode) {
		case CHANGE:	IO_CLR(GPIOA->IS, tmp); IO_SET(GPIOA->IBE, tmp);                           break;	//both edge triggered
		case FALLING:	IO_CLR(GPIOA->IS, tmp); IO_CLR(GPIOA->IBE, tmp);  IO_CLR(GPIOA->IEV, tmp); break;	//falling edge only
		case RISING:	IO_CLR(GPIOA->IS, tmp); IO_CLR(GPIOA->IBE, tmp);  IO_SET(GPIOA->IEV, tmp); break;	//rising edge only
	}
	IO_SET(GPIOA->IE, tmp);					//1->enable interrupt, 0->disable interrupt
	
	//configure nvic
	//NVIC_ClearPendingIRQ(GPIOA_IRQn);
	NVIC_ClearPendingIRQ(GPIOA_IRQn);
	NVIC_EnableIRQ(GPIOA_IRQn);

