dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
}

//gpiob isr
static void (* _gpiob_isrptr)(void)=empty_handler;				//tmr_ptr pointing to empty_handler by default

//gpioa isr
void ISR GPIOB_IRQHandler(void) {
	_gpiob_isrptr();						//execute user isr - it has to clear its own flags
	//optional
	//GPIOB->IC = GPIOB->IC;				//write 1 to clear
}

//default setting
void GPIOBAttachISR(void (*isrptr)(void), PIN_TypeDef pin, uint8_t mode) {
	uint32_t tmp=1ul<<(pin-PB0);			//pin
	_gpiob_isrptr = isrptr;					//install user handler

	//configure triggering mode
	//IO_CLR(GPIOB->IS, tmp);				//1->level triggered, 0->edge triggered
	//IO_CLR(GPIOB->IBE, tmp);				//1->both edge triggered, 0->single edge triggered (see IEV)
	//IO_CLR(GPIOB->IEV, tmp);				//1->triggered by high level / rising edge, 0->triggered by low level / falling edge
	switch (mode) {
		case CHANGE:	IO_CLR(GPIOB->IS, tmp); IO_SET(GPIOB->IBE, tmp);                           break;	//both edge triggered
		case FALLING:	IO_CLR(GPIOB->IS, tmp); IO_CLR(GPIOB->IBE, tmp);  IO_CLR(GPIOB->IEV, tmp); break;	//falling edge only
		case RISING:	IO_CLR(GPIOB->IS, tmp); IO_CLR(GPIOB->IBE, tmp);  IO_SET(GPIOB->IEV, tmp); break;	//rising edge only
	}
	IO_SET(GPIOB->IE, tmp);					//1->enable interrupt, 0->disable interrupt
	
	//configure nvic
	//NVIC_ClearPendingIRQ(GPIOB_IRQn);
	NVIC_ClearPendingIRQ(GPIOB_IRQn);
	NVIC_EnableIRQ(GPIOB_IRQn);

}
//end arduino gpio

//uart
#define UART_RXEN_BIT			(1<<7)					//1->enable TX
#define UART_TXEN_BIT			(1<<6)					//1->enable RX
#define UART_BRKEN_BIT			(1<<5)					//1->send break
#define UART_BRKDIS_BIT			(0<<5)					//1->send break
#define UART_PARITYODD_BIT		(1<<4)					//1->odd partity
#define UART_PARITYEVEN_BIT		(0<<4)					//0->even partity
#define UART_PARITYEN_BIT		(1<<3)					//1->enable partity
#define UART_PARITYDIS_BIT		(0<<3)					//0->disable partity
#define UART_STOP1_BIT			(0<<2)					//0->1 stop bit
#define UART_STOP2_BIT			(1<<2)					//1->2 stop bits
#define UART_5BITS_VAL			(0x00)                  //0->5 bits
#define UART_6BITS_VAL			(0x01)                  //0->6 bits
#define UART_7BITS_VAL			(0x02)                  //0->7 bits
#define UART_8BITS_VAL			(0x03)                  //0->8 bits

//char uRAM[uRAM_SIZE];			//transmission buffer, 40-1 char max

//uart0
volatile char *_U0TX_ptr;									//buffer pointer
UART_HandleTypeDef huart0;

//8 data bits, 1 stop bit, no parity, tx/rx enabled
void uart0Init (unsigned long baudrate) {
	//enable clock to uart
	RCC->CLK_EN |= (1<<1);									//1->enable clock. bit6..1 = uart5..0
	//enable the clock to uart0
	//REG_SET(HR_CLK_GATE_EN, 1<<1);						//1->enable clock, bit 11=gpio, 10=timer, 6..1=uart5..0

	NVIC_DisableIRQ(UART0_IRQn);
	NVIC_ClearPendingIRQ(UART0_IRQn);

#if defined(USE_HALUART)
	//UART_HandleTypeDef huart0;

	huart0.Instance = UART0;
	huart0.Init.BaudRate = baudrate;
	huart0.Init.WordLength = UART_WORDLENGTH_8B;
	huart0.Init.StopBits = UART_STOPBITS_1;
	huart0.Init.Parity = UART_PARITY_NONE;
	huart0.Init.Mode = UART_MODE_TX | UART_MODE_RX;
	huart0.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	if (HAL_UART_Init(&huart0) != HAL_OK) {
        empty_handler();									//Error_Handler();
    }
#else		//baremetal
	unsigned long bd;

	//make sure that the baudrate isn't too high for F_UART
	if (F_UART/(16*baudrate)) {
		bd = (F_UART/(16*baudrate) - 1)|((((F_UART%(baudrate*16))*16+(baudrate*8))/(baudrate*16))<<16);	//improved version, with rounding up
		//bd = (F_UART/(16*baudrate) - 1)|(((F_UART%(baudrate*16))*16/(baudrate*16))<<16);					//original version, no rounding up
	} else {
		bd = (1                   - 1)|((((F_UART%(baudrate*16))*16+(baudrate*8))/(baudrate*16))<<16);	//improved version, with rounding up
		//bd = (1                   - 1)|(((F_UART%(baudrate*16))*16/(baudrate*16))<<16);					//original version, no rounding up
	}
	UART0->BAUDR = bd;									//tls_reg_write32(HR_UART0_BAUD_RATE_CTRL, bd);

	//UART0->LC = UART_8BITS_VAL | UART_TXEN_BIT | UART_RXEN_BIT | UART_STOP1_BIT | UART_PARITYEVEN_BIT | UART_PARITYDIS_BIT;	//tls_reg_write32(HR_UART0_LINE_CTRL, UART_BITSTOP_VAL | UART_TXEN_BIT | UART_RXEN_BIT);
	UART0->LC = 
				UART_RXEN_BIT |								//0->disable rx, 1->enable rx	//tls_reg_write32(HR_UART5_LINE_CTRL, UART_8BITS_VAL | UART_TXEN_BIT | UART_RXEN_BIT | UART_STOP1_BIT | UART_PARITYEVEN_BIT | UART_PARITYDIS_BIT);
				UART_TXEN_BIT |								//0->disable tx, 1->enable tx
				UART_BRKDIS_BIT |							//0->disable break; 1->enable break;
				UART_PARITYEVEN_BIT |						//0->even parity, 1->odd parity
				UART_PARITYDIS_BIT |						//0->disable parity, 1->enable parity
				UART_STOP1_BIT |							//0->1 stop bit, 1->2 stop bits
				UART_8BITS_VAL |							//0->5 bits, 1->6 bits, 2->7 bits, 3->8 bits
				0x00;

	UART0->FC = 0x00;										//tls_reg_write32(HR_UART0_FLOW_CTRL, 0x00);   			/* Disable afc */
	UART0->DMAC=0x00;										//tls_reg_write32(HR_UART0_DMA_CTRL, 0x00);             		/* Disable DMA */
	//UART0->FIFOC=0x00;									//tls_reg_write32(HR_UART0_FIFO_CTRL, 0x00);             		/* one byte TX/RX */
	UART0->INTM=0x00;										//tls_reg_write32(HR_UART0_INT_MASK, 0x00);             		/* Disable INT */
#endif	//use_haluart

	//uart0 rx/tx pin assignment
#if defined(UART0TX2PIN)
	UART0TX2PIN();
#endif

#if defined(UART0RX2PIN)
	UART0RX2PIN();
#endif

}

//put a string
void uart0Puts(char *str) {
#ifndef UART_TXISR
#if defined(USE_HALUART)
	HAL_UART_Transmit(&huart0, (uint8_t *)str, strlen(str), 1000);
#else		//baremetal
    //polling transmission
    while(*str) {
        uart0Putch(*str++);	//send the ch and advance the pointer
    }
#endif		//use_haluart
#else
    //interrupt transmission
    if (*str) {								//if the string isn't empty to begin with
        uart0Wait();						//for compatability with polling transmission
        //U1TXREG = 0;						//clear the buffer
        //_U1TX_BUSY  = 1;					//transmission in progress
        _U0TX_ptr=str;						//point to the string to be transmitted
        IFS1bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
        //U1STAbits.UTXEN = 1;				//enable transmission - always enabled
        //tmp = *_UxTX_ptr++;	UxTXREG = tmp;						//*_UxTX_ptr++;				//load up the 1st char. advance to the next char
        UART0->TDW = *_U0TX_ptr++;			//U1TXREG = *_U1TX_ptr++;
        IEC1bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
    }
#endif
}

