dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//test if data rx is available
//uint16_t uart1Available(void) {
//	return U1STAbits.URXDA;
//}

//test if uart tx is busy
//uint16_t uart1Busy(void) {
//	return U1STAbits.UTXBF;
//}

//print to uart2
void u2Print(char *str, int32_t dat) {
    static char uRAM[uRAM_SIZE];		//uart print buffer

    //uart1Wait();						//wait for the prior transmission to finish
    //while (IEC1bits.U1TXIE) continue;

    //form the string
    strcpy(uRAM, str);					//copy to uram
    if (dat < 0) {
        uRAM[6]='-';
        dat = -dat;
    }
    uRAM[19]='0'+(dat % 10); dat /= 10;
    uRAM[18]='0'+(dat % 10); dat /= 10;
    uRAM[17]='0'+(dat % 10); dat /= 10;
    uRAM[16]=',';	//'0'+(dat % 10); dat /= 10;
    uRAM[15]='0'+(dat % 10); dat /= 10;
    uRAM[14]='0'+(dat % 10); dat /= 10;
    uRAM[13]='0'+(dat % 10); dat /= 10;
    uRAM[12]=',';	//'0'+(dat % 10); dat /= 10;
    uRAM[11]='0'+(dat % 10); dat /= 10;
    uRAM[10]='0'+(dat % 10); dat /= 10;
    uRAM[ 9]='0'+(dat % 10); dat /= 10;
    uRAM[ 8]=',';	//'0'+(dat % 10); dat /= 10;
    uRAM[ 7]='0'+(dat % 10); dat /= 10;
    uart2Puts(uRAM);	//send a message on uart1
}

//circular buffer for uart2 transmission
//initialize uart2 using cb
void u2CBInit(CB_TypeDef *cb, uint32_t bps) {
	uart2Init(bps);
	cbInit(cb);
}

// transmit on uart2 using CB
void u2CBTX(CB_TypeDef *cb) {
	while ((!cbEmpty(cb)) && (!uart2TXFull())) uart2Putch(cbRead(cb));
}
//uart3
volatile char *_U3TX_ptr;									//buffer pointer
UART_HandleTypeDef huart3;

//8 data bits, 1 stop bit, no parity, tx/rx enabled
void uart3Init (unsigned long baudrate) {
	unsigned long bd;

	//enable clock to uart
	RCC->CLK_EN |= (1<<4);									//1->enable clock. bit6..1 = uart5..0
	//enable the clock to uart3
	//REG_SET(HR_CLK_GATE_EN, 1<<4);						//1->enable clock, bit 11=gpio, 10=timer, 6..1=uart5..0

	NVIC_DisableIRQ(UART2_5_IRQn);
	NVIC_ClearPendingIRQ(UART2_5_IRQn);

#if defined(USE_HALUART)
	//UART_HandleTypeDef huart3;

	huart3.Instance = UART3;
	huart3.Init.BaudRate = baudrate;
	huart3.Init.WordLength = UART_WORDLENGTH_8B;
	huart3.Init.StopBits = UART_STOPBITS_1;
	huart3.Init.Parity = UART_PARITY_NONE;
	huart3.Init.Mode = UART_MODE_TX | UART_MODE_RX;
	huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	if (HAL_UART_Init(&huart3) != HAL_OK) {
        empty_handler();									//Error_Handler();
    }
#else		//baremetal
	//make sure that the baudrate isn't too high for F_UART
if (F_UART/(16*baudrate)) {
		bd = (F_UART/(16*baudrate) - 1)|((((F_UART%(baudrate*16))*16+(baudrate*8))/(baudrate*16))<<16);	//improved version, with rounding up
		//bd = (F_UART/(16*baudrate) - 1)|(((F_UART%(baudrate*16))*16/(baudrate*16))<<16);					//original version, no rounding up
	} else {
		bd = (1                   - 1)|((((F_UART%(baudrate*16))*16+(baudrate*8))/(baudrate*16))<<16);	//improved version, with rounding up
		//bd = (1                   - 1)|(((F_UART%(baudrate*16))*16/(baudrate*16))<<16);					//original version, no rounding up
	}
	UART3->BAUDR = bd;									//tls_reg_write32(HR_UART3_BAUD_RATE_CTRL, bd);

	//tls_reg_write32(HR_UART3_LINE_CTRL, UART_8BITS_VAL | UART_TXEN_BIT | UART_RXEN_BIT | UART_STOP1_BIT | UART_PARITYEVEN_BIT | UART_PARITYDIS_BIT);
	UART3->LC = 
				UART_RXEN_BIT |								//0->disable rx, 1->enable rx	//tls_reg_write32(HR_UART5_LINE_CTRL, UART_8BITS_VAL | UART_TXEN_BIT | UART_RXEN_BIT | UART_STOP1_BIT | UART_PARITYEVEN_BIT | UART_PARITYDIS_BIT);
				UART_TXEN_BIT |								//0->disable tx, 1->enable tx
				UART_BRKDIS_BIT |							//0->disable break; 1->enable break;
				UART_PARITYEVEN_BIT |						//0->even parity, 1->odd parity
				UART_PARITYDIS_BIT |						//0->disable parity, 1->enable parity
				UART_STOP1_BIT |							//0->1 stop bit, 1->2 stop bits
				UART_8BITS_VAL |							//0->5 bits, 1->6 bits, 2->7 bits, 3->8 bits
				0x00;

	//tls_reg_write32(HR_UART3_FLOW_CTRL, 0x00);   			/* Disable afc */
	UART3->FC = 0x00;
	//tls_reg_write32(HR_UART3_DMA_CTRL, 0x00);             /* Disable DMA */
	UART3->DMAC=0x00;
	//tls_reg_write32(HR_UART3_FIFO_CTRL, 0x00);            /* one byte TX/RX */
	//tls_reg_write32(HR_UART3_INT_MASK, 0x00);            	/* Disable INT */
	UART3->INTM=0x00;
#endif	//use_haluart

	//uart3 rx/tx pin assignment
#if defined(UART3TX2PIN)
	UART3TX2PIN();
#endif

#if defined(UART3RX2PIN)
	UART3RX2PIN();
#endif

}


//put a string
void uart3Puts(char *str) {
#ifndef UART_TXISR
#if defined(USE_HALUART)
	HAL_UART_Transmit(&huart3, (uint8_t *)str, strlen(str), 1000);
#else		//baremetal
    //polling transmission
    while(*str) {
        uart3Putch(*str++);	//send the ch and advance the pointer
    }
#endif		//use_haluart
#else
    //interrupt transmission
    if (*str) {								//if the string isn't empty to begin with
        uart1Wait();						//for compatability with polling transmission
        //U1TXREG = 0;						//clear the buffer
        //_U1TX_BUSY  = 1;					//transmission in progress
        _U0TX_ptr=str;						//point to the string to be transmitted
        IFS1bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
        //U1STAbits.UTXEN = 1;				//enable transmission - always enabled
        //tmp = *_UxTX_ptr++;	UxTXREG = tmp;						//*_UxTX_ptr++;				//load up the 1st char. advance to the next char
        UART1->TDW = *_U0TX_ptr++;			//U1TXREG = *_U1TX_ptr++;
        IEC1bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
    }
#endif
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

//put a line termined with ln
//void uart1Putline(char *ln) {
//	//USARTWriteString(ln);
//	uart1Puts(ln);
//	//USARTWriteString("\r\n");
//	uart1Puts((char *)"\r\n");
//}

//get the received char
//uint8_t uart1Getch(void) {
//	return U1RXREG;		//return it
//}

//test if data rx is available
//uint16_t uart1Available(void) {
//	return U1STAbits.URXDA;
//}

