dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//install user handler
void tmr0AttachISR(void (*isrptr)(void)) {
	TIM->CR|=	(1<<4) << (0*5);		//1->clear the interrupt flag, 0->no effect
	//NVIC_DisableIRQ(TIM_IRQn);
	//NVIC_ClearPendingIRQ(TIM_IRQn);

	_tmr0_isrptr=isrptr;				//install user isr
	TIM->CR|= (1<<3) << (0*5);			//1->enable the interrupt, 0->disable the interrupt
	//NVIC_SetPriority(TIM_IRQn, 0);	//set priority
	NVIC_ClearPendingIRQ(TIM_IRQn);		//clear pending flag
	NVIC_EnableIRQ(TIM_IRQn);			//enable the interrupt
}

//tmr1
void tmr1Init(void) {
	//enable clock to timer
	RCC->CLK_EN |= (1<<10);				//1->enable clock. bit 10 = timer

	//disable the interrupt
	NVIC_DisableIRQ(TIM_IRQn);
	NVIC_ClearPendingIRQ(TIM_IRQn);

	//configure the timer
	_tmr1_isrptr = empty_handler;		//reset timer isr pointer
	TIM->CR = 	(TIM->CR &~(0x1f<<(1*5))) |
	            (0x00 << (1*5));		//0x00->stop / reset the timer
	//TIM->TIM0_CNT=0;					//clear the counter -> read only :)
	//TIM->TMR_CONFIG = 0;				//F_CPU/1000000-1;			//set the prescaler to f_cpu/1000000-1 so timer increments once per us
	TIM->TIM1_PRD = 0xfffffffful;		//set the timer period - maximum @ 32-bit
	TIM->CR|= 	((1<<4) |				//1->clear the interrupt flag, 0->no effect
	             (0<<3) |				//1->enable the interrupt, 0->disable the interrupt
	             (1<<2) | 				//1->enable the timer, 0->disable the timer
	             (0<<1) |				//0->periodic timer, 1->single shot
	             (0<<0)) << (1*5);		//1->timing unit is ms, 0->timing unit is us
}

//install user handler
void tmr1AttachISR(void (*isrptr)(void)) {
	TIM->CR|=	(1<<4) << (1*5);		//1->clear the interrupt flag, 0->no effect
	//NVIC_DisableIRQ(TIM_IRQn);
	//NVIC_ClearPendingIRQ(TIM_IRQn);

	_tmr1_isrptr=isrptr;				//install user isr
	TIM->CR|= (1<<3) << (1*5);			//1->enable the interrupt, 0->disable the interrupt
	//NVIC_SetPriority(TIM_IRQn, 0);	//set priority
	NVIC_ClearPendingIRQ(TIM_IRQn);		//clear pending flag
	NVIC_EnableIRQ(TIM_IRQn);			//enable the interrupt
}

//tmr2
void tmr2Init(void) {
	//enable clock to timer
	RCC->CLK_EN |= (1<<10);				//1->enable clock. bit 10 = timer

	//disable the interrupt
	NVIC_DisableIRQ(TIM_IRQn);
	NVIC_ClearPendingIRQ(TIM_IRQn);

	//configure the timer
	_tmr2_isrptr = empty_handler;		//reset timer isr pointer
	TIM->CR = 	(TIM->CR &~(0x1f<<(2*5))) |
	            (0x00 << (2*5));		//0x00->stop / reset the timer
	//TIM->TIM0_CNT=0;					//clear the counter -> read only :)
	//TIM->TMR_CONFIG = 0;				//F_CPU/1000000-1;			//set the prescaler to f_cpu/1000000-1 so timer increments once per us
	TIM->TIM2_PRD = 0xfffffffful;		//set the timer period - maximum @ 32-bit
	TIM->CR|= 	((1<<4) |				//1->clear the interrupt flag, 0->no effect
	             (0<<3) |				//1->enable the interrupt, 0->disable the interrupt
	             (1<<2) | 				//1->enable the timer, 0->disable the timer
	             (0<<1) |				//0->periodic timer, 1->single shot
	             (0<<0)) << (2*5);		//1->timing unit is ms, 0->timing unit is us
}

//install user handler
void tmr2AttachISR(void (*isrptr)(void)) {
	TIM->CR|=	(1<<4) << (2*5);		//1->clear the interrupt flag, 0->no effect
	//NVIC_DisableIRQ(TIM_IRQn);
	//NVIC_ClearPendingIRQ(TIM_IRQn);

	_tmr2_isrptr=isrptr;				//install user isr
	TIM->CR|= (1<<3) << (2*5);			//1->enable the interrupt, 0->disable the interrupt
	//NVIC_SetPriority(TIM_IRQn, 0);	//set priority
	NVIC_ClearPendingIRQ(TIM_IRQn);		//clear pending flag
	NVIC_EnableIRQ(TIM_IRQn);			//enable the interrupt
}

//tmr3
void tmr3Init(void) {
	//enable clock to timer
	RCC->CLK_EN |= (1<<10);				//1->enable clock. bit 10 = timer

	//disable the interrupt
	NVIC_DisableIRQ(TIM_IRQn);
	NVIC_ClearPendingIRQ(TIM_IRQn);

	//configure the timer
	_tmr3_isrptr = empty_handler;		//reset timer isr pointer
	TIM->CR = 	(TIM->CR &~(0x1f<<(3*5))) |
	            (0x00 << (3*5));		//0x00->stop / reset the timer
	//TIM->TIM0_CNT=0;					//clear the counter -> read only :)
	//TIM->TMR_CONFIG = 0;				//F_CPU/1000000-1;			//set the prescaler to f_cpu/1000000-1 so timer increments once per us
	TIM->TIM3_PRD = 0xfffffffful;		//set the timer period - maximum @ 32-bit
	TIM->CR|= 	((1<<4) |				//1->clear the interrupt flag, 0->no effect
	             (0<<3) |				//1->enable the interrupt, 0->disable the interrupt
	             (1<<2) | 				//1->enable the timer, 0->disable the timer
	             (0<<1) |				//0->periodic timer, 1->single shot
	             (0<<0)) << (3*5);		//1->timing unit is ms, 0->timing unit is us
}

//install user handler
void tmr3AttachISR(void (*isrptr)(void)) {
	TIM->CR|=	(1<<4) << (3*5);		//1->clear the interrupt flag, 0->no effect
	//NVIC_DisableIRQ(TIM_IRQn);
	//NVIC_ClearPendingIRQ(TIM_IRQn);

	_tmr3_isrptr=isrptr;				//install user isr
	TIM->CR|= (1<<3) << (3*5);			//1->enable the interrupt, 0->disable the interrupt
	//NVIC_SetPriority(TIM_IRQn, 0);	//set priority
	NVIC_ClearPendingIRQ(TIM_IRQn);		//clear pending flag
	NVIC_EnableIRQ(TIM_IRQn);			//enable the interrupt
}

//tmr4
void tmr4Init(void) {
	//enable clock to timer
	RCC->CLK_EN |= (1<<10);				//1->enable clock. bit 10 = timer

	//disable the interrupt
	NVIC_DisableIRQ(TIM_IRQn);
	NVIC_ClearPendingIRQ(TIM_IRQn);

	//configure the timer
	_tmr4_isrptr = empty_handler;		//reset timer isr pointer
	TIM->CR = 	(TIM->CR &~(0x1f<<(4*5))) |
	            (0x00 << (4*5));		//0x00->stop / reset the timer
	//TIM->TIM0_CNT=0;					//clear the counter -> read only :)
	//TIM->TMR_CONFIG = 0;				//F_CPU/1000000-1;			//set the prescaler to f_cpu/1000000-1 so timer increments once per us
	TIM->TIM4_PRD = 0xfffffffful;		//set the timer period - maximum @ 32-bit
	TIM->CR|= 	((1<<4) |				//1->clear the interrupt flag, 0->no effect
	             (0<<3) |				//1->enable the interrupt, 0->disable the interrupt
	             (1<<2) | 				//1->enable the timer, 0->disable the timer
	             (0<<1) |				//0->periodic timer, 1->single shot
	             (0<<0)) << (4*5);		//1->timing unit is ms, 0->timing unit is us
}

