dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//install user handler
void tmr4AttachISR(void (*isrptr)(void)) {
	TIM->CR|=	(1<<4) << (4*5);		//1->clear the interrupt flag, 0->no effect
	//NVIC_DisableIRQ(TIM_IRQn);
	//NVIC_ClearPendingIRQ(TIM_IRQn);

	_tmr4_isrptr=isrptr;				//install user isr
	TIM->CR|= (1<<3) << (4*5);			//1->enable the interrupt, 0->disable the interrupt
	//NVIC_SetPriority(TIM_IRQn, 0);	//set priority
	NVIC_ClearPendingIRQ(TIM_IRQn);		//clear pending flag
	NVIC_EnableIRQ(TIM_IRQn);			//enable the interrupt
}

//tmr5
void tmr5Init(void) {
	//enable clock to timer
	RCC->CLK_EN |= (1<<10);				//1->enable clock. bit 10 = timer

	//disable the interrupt
	NVIC_DisableIRQ(TIM_IRQn);
	NVIC_ClearPendingIRQ(TIM_IRQn);

	//configure the timer
	_tmr5_isrptr = empty_handler;		//reset timer isr pointer
	TIM->CR = 	(TIM->CR &~(0x1f<<(5*5))) |
	            (0x00 << (5*5));		//0x00->stop / reset the timer
	//TIM->TIM0_CNT=0;					//clear the counter -> read only :)
	//TIM->TMR_CONFIG = 0;				//F_CPU/1000000-1;			//set the prescaler to f_cpu/1000000-1 so timer increments once per us
	TIM->TIM5_PRD = 0xfffffffful;		//set the timer period - maximum @ 32-bit
	TIM->CR|= 	((1<<4) |				//1->clear the interrupt flag, 0->no effect
	             (0<<3) |				//1->enable the interrupt, 0->disable the interrupt
	             (1<<2) | 				//1->enable the timer, 0->disable the timer
	             (0<<1) |				//0->periodic timer, 1->single shot
	             (0<<0)) << (5*5);		//1->timing unit is ms, 0->timing unit is us
}

//install user handler
void tmr5AttachISR(void (*isrptr)(void)) {
	TIM->CR|=	(1<<4) << (5*5);			//1->clear the interrupt flag, 0->no effect
	//NVIC_DisableIRQ(TIM_IRQn);
	//NVIC_ClearPendingIRQ(TIM_IRQn);

	_tmr5_isrptr=isrptr;					//install user isr
	TIM->CR|= (1<<3) << (5*5);				//1->enable the interrupt, 0->disable the interrupt
	//NVIC_SetPriority(TIM_IRQn, 0);		//set priority
	NVIC_ClearPendingIRQ(TIM_IRQn);			//clear pending flag
	NVIC_EnableIRQ(TIM_IRQn);				//enable the interrupt
}
//end timer

//pwm
//initialize pwm0
void pwm0Init(void) {
	//enable clock to pwm
	RCC->CLK_EN |= (1<<13);					//1->enable clock. bit 13 = pwm

	//reset devider
	//PWM->CLKDIV01 = 0;
	//PWM->CLKDIV23 = 0;
	//disable pwm
	PWM->CR &=~(1<<27);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0
	PWM->CR  = 	(PWM->CR &~(0x03<<16)) |	//bit17..16=ch0, bit 19..18=ch1, bit 21..20=ch2, bit 23..22=ch3
	            (0x01 << 16);				//pwm mode: 0b01->edge aligned, 0b10-> center aligned (downcounter)
	PWM->CR |= (1<<8);						//1->auto reload, 0->single shot. bit 11..8 for ch3..0
	//W801 boards are active low - so reverse polarity
	PWM->CR |= (1<<2);						//1->reverse polarity, 0->normal polarity. bit 5..2 for ch3..0
	//PWM->CR &=~(1<<0);					//1->complimentary output, 0->single pole

	//set period
	PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (0*8))) |
	                (0xff << (0*8));		//period, 8 bit only
	//PWM->PNUM =		(PWM->PNUM &~(0xff << (0*8))) |
	//				(0x00 << (0*8));		//pnum is 0
	//enable pwm
	PWM->CR |= (1<<27);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0

#if defined(PWM02PIN)
	PWM02PIN();
#endif
}

//initialize pwm1
void pwm1Init(void) {
	//enable clock to pwm
	RCC->CLK_EN |= (1<<13);					//1->enable clock. bit 13 = pwm

	//reset devider
	//PWM->CLKDIV01 = 0;
	//PWM->CLKDIV23 = 0;
	//disable pwm
	PWM->CR &=~(1<<28);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0
	PWM->CR  = 	(PWM->CR &~(0x03<<18)) |	//bit17..16=ch0, bit 19..18=ch1, bit 21..20=ch2, bit 23..22=ch3
	            (0x01 << 18);				//pwm mode: 0b01->edge aligned, 0b10-> center aligned (downcounter)
	PWM->CR |= (1<<9);						//1->auto reload, 0->single shot. bit 11..8 for ch3..0
	//W801 boards are active low - so reverse polarity
	PWM->CR |= (1<<3);						//1->reverse polarity, 0->normal polarity. bit 5..2 for ch3..0
	//PWM->CR &=~(1<<0);					//1->complimentary output, 0->single pole

	//set period
	PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (1*8))) |
	                (0xff << (1*8));		//period, 8 bit only
	//PWM->PNUM =		(PWM->PNUM &~(0xff << (0*8))) |
	//				(0x00 << (0*8));		//pnum is 0
	//enable pwm
	PWM->CR |= (1<<28);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0

#if defined(PWM12PIN)
	PWM12PIN();
#endif
}

//initialize pwm2
void pwm2Init(void) {
	//enable clock to pwm
	RCC->CLK_EN |= (1<<13);					//1->enable clock. bit 13 = pwm

	//reset devider
	//PWM->CLKDIV01 = 0;
	//PWM->CLKDIV23 = 0;
	//disable pwm
	PWM->CR &=~(1<<29);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0
	PWM->CR  = 	(PWM->CR &~(0x03<<20)) |	//bit17..16=ch0, bit 19..18=ch1, bit 21..20=ch2, bit 23..22=ch3
	            (0x01 << 20);				//pwm mode: 0b01->edge aligned, 0b10-> center aligned (downcounter)
	PWM->CR |= (1<<10);						//1->auto reload, 0->single shot. bit 11..8 for ch3..0
	//W801 boards are active low - so reverse polarity
	PWM->CR |= (1<<4);						//1->reverse polarity, 0->normal polarity. bit 5..2 for ch3..0
	//PWM->CR &=~(1<<0);					//1->complimentary output, 0->single pole

	//set period
	PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (2*8))) |
	                (0xff << (2*8));		//period, 8 bit only
	//PWM->PNUM =		(PWM->PNUM &~(0xff << (0*8))) |
	//				(0x00 << (0*8));		//pnum is 0
	//enable pwm
	PWM->CR |= (1<<29);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0

#if defined(PWM22PIN)
	PWM22PIN();
#endif
}

//initialize pwm3
void pwm3Init(void) {
	//enable clock to pwm
	RCC->CLK_EN |= (1<<13);					//1->enable clock. bit 13 = pwm

	//reset devider
	//PWM->CLKDIV01 = 0;
	//PWM->CLKDIV23 = 0;
	//disable pwm
	PWM->CR &=~(1<<30);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0
	PWM->CR  = 	(PWM->CR &~(0x03<<22)) |	//bit17..16=ch0, bit 19..18=ch1, bit 21..20=ch2, bit 23..22=ch3
	            (0x01 << 22);				//pwm mode: 0b01->edge aligned, 0b10-> center aligned (downcounter)
	PWM->CR |= (1<<11);						//1->auto reload, 0->single shot. bit 11..8 for ch3..0
	//W801 boards are active low - so reverse polarity
	PWM->CR |= (1<<5);						//1->reverse polarity, 0->normal polarity. bit 5..2 for ch3..0
	//PWM->CR &=~(1<<0);					//1->complimentary output, 0->single pole

