dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
	//set period
	PWM->PERIOD = 	(PWM->PERIOD &~(0xff << (3*8))) |
	                (0xff << (3*8));		//period, 8 bit only
	//PWM->PNUM =		(PWM->PNUM &~(0xff << (0*8))) |
	//				(0x00 << (0*8));		//pnum is 0
	//enable pwm
	PWM->CR |= (1<<30);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0

#if defined(PWM32PIN)
	PWM32PIN();
#endif
}

//initialize pwm4
//***pwm4*** is special - code below is bespoke to pwm4
void pwm4Init(void) {
	//enable clock to pwm
	RCC->CLK_EN |= (1<<13);					//1->enable clock. bit 13 = pwm

	//reset devider
	//PWM->CLKDIV01 = 0;
	//PWM->CLKDIV23 = 0;
	//disable pwm
	PWM->CR &=~(1<<31);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0
	PWM->CH4CR2 = 	(PWM->CH4CR2 &~(0x03 << 3)) |
	            (0x01 << 3);				//pwm mode: 0b01->edge aligned, 0b10-> center aligned (downcounter)
	PWM->CH4CR2 |= (1 << 1);				//1->auto reload, 0->single shot. bit 11..8 for ch4..0
	//W801 boards are active low - so reverse polarity
	PWM->CH4CR2 |= (1 << 0);				//1->reverse polarity, 0->normal polarity. bit 5..2 for ch4..0
	//PWM->CR &=~(1<<0);					//1->complimentary output, 0->single pole

	//set period
	PWM->CH4CR1 = 	(PWM->CH4CR1 &~(0xff << (1*8))) |
	                (0xff << (1*8));		//period, 8 bit only
	//PWM->PNUM =		(PWM->PNUM &~(0xff << (0*8))) |
	//				(0x00 << (0*8));		//pnum is 0
	//enable pwm
	PWM->CR |= (1<<31);						//1->enable cnt, 0->disable cnt. bit 31..27 for channel 4..0

#if defined(PWM42PIN)
	PWM42PIN();
#endif
}

//write pwm to a pin
void analogWrite(uint8_t pin, uint16_t dc) {
	dc = dc & 0xff;							//8-bit wide
	switch (pin) {
		//pwm ch0
		case PB0: pwm0Init(); PWM0SetDC(dc); PWM02PB0(); break;
		case PB19:pwm0Init(); PWM0SetDC(dc); PWM02PB19();break;
		case PB12:pwm0Init(); PWM0SetDC(dc); PWM02PB12();break;
		case PA2: pwm0Init(); PWM0SetDC(dc); PWM02PA2(); break;
		case PA10:pwm0Init(); PWM0SetDC(dc); PWM02PA10();break;

		//pwm ch1
		case PB1: pwm1Init(); PWM1SetDC(dc); PWM12PB1(); break;
		case PB20:pwm1Init(); PWM1SetDC(dc); PWM12PB20();break;
		case PB13:pwm1Init(); PWM1SetDC(dc); PWM12PB13();break;
		case PA3: pwm1Init(); PWM1SetDC(dc); PWM12PA3(); break;
		case PA11:pwm1Init(); PWM1SetDC(dc); PWM12PA11();break;

		//pwm ch2
		case PA0: pwm2Init(); PWM2SetDC(dc); PWM22PA0(); break;
		case PB2: pwm2Init(); PWM2SetDC(dc); PWM22PB2();break;
		case PB14:pwm2Init(); PWM2SetDC(dc); PWM22PB14(); break;
		case PA12:pwm2Init(); PWM2SetDC(dc); PWM22PA12();break;
		case PB24:pwm2Init(); PWM2SetDC(dc); PWM22PB24();break;

		//pwm ch3
		case PA1: pwm3Init(); PWM3SetDC(dc); PWM32PA1(); break;
		case PB3: pwm3Init(); PWM3SetDC(dc); PWM32PB3();break;
		case PB15:pwm3Init(); PWM3SetDC(dc); PWM32PB15(); break;
		case PA13:pwm3Init(); PWM3SetDC(dc); PWM32PA13();break;
		case PB25:pwm3Init(); PWM3SetDC(dc); PWM32PB25();break;

		//pwm ch4
		case PA4: pwm4Init(); PWM4SetDC(dc); PWM42PA4(); break;
		case PA7: pwm4Init(); PWM4SetDC(dc); PWM42PA7();break;
		case PA14:pwm4Init(); PWM4SetDC(dc); PWM42PA14(); break;
		case PB16:pwm4Init(); PWM4SetDC(dc); PWM42PB16();break;
		case PB26:pwm4Init(); PWM4SetDC(dc); PWM42PB26();break;

		default: break;	//do nothing
	}
}
//end pwm

//pmu
//initialize pmu
void pmuInit(void) {
	//route the clock to pmu
	//RCC->CLK_EN |= (1<<0);				//1->enable pmu, 0->disable pmu. bit 0 = pmu
	
	IO_SET(PMU->CR, 1<<4);					//1->clock from 40Mhz oscillator, 0->32Khz RC oscillator (default)
	//IO_CLR(PMU->CR, 1<<4);				//1->clock from 40Mhz oscillator, 0->32Khz RC oscillator (default)
	//0->1 to start calibration of the 32Khz rc oscillator
	IO_CLR(PMU->CR, 1<<3); 
	IO_SET(PMU->CR, 1<<3);					//1->start rc calibration, 0->no effect
	//while (PMU->CR & (1<<3)) continue;	//wait for it to clear?
	
	PMU->TIMER0 |= (1<<16);					//1->start timer0
	PMU->RSV    |= (1<<16);					//1->start timer1

	PMU->RTCCR0 &=~(1<<31);					//1->enable interrupt, 0->disable interrupt
	PMU->RTCCR1 |= (1<<16);					//1->enable alarm, 0->disable alartm
}

//void pmuStartT0(uint32_t sec) {
//	PMU->TIMER0  = 	(1<<16) |				//1->start timer
//					(sec & 0xffff);			//set sec
//}

//void pmuStartT1(uint32_t sec) {
//	PMU->TIMER1  = 	(1<<16) |				//1->start timer
//					(sec & 0xffff);			//set sec
//}

//end pmu

//watchdog timer
static void (* _wdg_isrptr)(void)=empty_handler;				//wdg timer pointing to empty_handler by default

//wdg isr
void ISR WDG_IRQHandler(void) {
	wdgIFClr();								//WDG->CLR = 0;							//write any value to clear the status
	_wdg_isrptr();							//execute user isr
}

//reset the watchdog timer
void wdgInit(void) {
	_wdg_isrptr = empty_handler;			//reset the handler
	
	//NVIC_SetPriority(WDG_IRQn, 0);		//set priority
	NVIC_ClearPendingIRQ(WDG_IRQn);			//clear pending flag
	NVIC_DisableIRQ(WDG_IRQn);				//enable the interrupt

	WDG->CLR = 0;							//write any value to clear interrupts
	//no reset, period timer
	WDG->CR =	(0<<1) |					//1->enable wdg reset, 0->disable wdg reset
				(1<<0) |					//1->enable periodic timer, 0->disable periodic timer
				0x00;
}

//attach usr isr
void wdgAttachISR(void (*isrptr)(void)) {
	//NVIC_SetPriority(WDG_IRQn, 0);		//set priority
	NVIC_ClearPendingIRQ(WDG_IRQn);			//clear pending flag
	NVIC_DisableIRQ(WDG_IRQn);				//disable the interrupt

	WDG->CLR = 0;							//write any value to clear interrupts
	
	_wdg_isrptr = isrptr;					//install user handler

	//NVIC_SetPriority(WDG_IRQn, 0);		//set priority
	NVIC_ClearPendingIRQ(WDG_IRQn);			//clear pending flag
	NVIC_EnableIRQ(WDG_IRQn);				//enable the interrupt
}
//end watchdog timer

//adc
//initialize adc
void adcInit(void) {
	uint32_t tmp=0;
	
	//enable clock to adc
	RCC->CLK_EN |= (1<<12);					//1->enable adc, 0->disable adc. bit 12 = adc
	
	//calculate adc clock divider
	tmp = F_PHB / F_ADC / 1024; if (tmp) tmp-=1;	// "/1000" is required. "/1024" is OK
	RCC->CLK_SEL = (RCC->CLK_SEL &~(0xff << 8)) | ((tmp & 0xff) << 8);
	RCC->CLK_EN |= (1<<31);					//set the en bit to make the clock effective
	
	//configure the adc
	ADC->ADC_CR = 	(0x50 <<20) |			//sampling time after channel switch, default 0x50
					(0x50 << 8) |			//time for the analog circuit to be stable after adc start, default 0x50
					(0 << 5) |				//0->disable comparator interrupt, 1->enable comparator interrupt
					(0 << 4) |				//0->disable analog comp, 1->enable analog comp
					(0 << 1) |				//1->enable interrupt, 0->disable interrupt
					(0 << 0) |				//0->disable dma, 1->enable dma
					0x00;
	ADC->PGA_CR =	(0 << 4) |				//pga gain, 0..1023 / 0x3ff
					(0 << 3) |				//0-> don't bypass PGA, 1->bypass PGA
					(0 << 2) |				//0-> don't bypass internal Vref, 1->bypass internal Vref
					(1 << 1) |				//1-> enable chopper, 0->disable chopper
					(1 << 0) |				//1-> enable pga, 0->disable pga
					0x00;

