dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
	//calculate offset
	ADC->ANA_CR =	(0b1110 << 8) |			//0b1110 = offset channel
					(0 << 2) |				//pd_sdadc: 0->enable, 1->disable
					(1 << 1) |				//rstn_sdadc: 1->normal, 0->disable
					(1 << 0) |				//1->enable adc ldo, 0->disable adc ldo
					0x00;
	//adcOffset(8);							//calibrate the adc for offset
}

//read adc
//support SE and diff inputs
uint32_t adcRead(uint8_t ch) {
	uint32_t tmp;
	
	//select the pipns
	switch (ch) {
		case ADC_CH0: ADC02PIN(); break;	//ch0 input
		case ADC_CH1: ADC12PIN(); break;	//ch1 input
		case ADC_CH2: ADC22PIN(); break;	//ch2 input
		case ADC_CH3: ADC32PIN(); break;	//ch3 input
		case ADC_CH01:ADC02PIN(); ADC12PIN(); break;	//ch 0-1 input
		case ADC_CH23:ADC22PIN(); ADC32PIN(); break;	//ch 2-3 input
	}
	//set the adc channel
	ADC->ANA_CR = 	(ADC->ANA_CR &~(0b1111 << 8)) |	
					((ch & 0b1111) << 8);
	ADC->ANA_CR|= (1<<0);					//1->enable adc ldo, 0->disable adc ldo
	ADC_DLY();
	//ADC->IF |= (1<< 0);						//1->clear adc interrupt flag
	//ADC_DLY();		//while ((ADC->IF & (1<<0)) == 0) continue;	//wait for ADC->IF bit 0 to be set -> indicating end of conversion
	//ADC->IF |= (1<< 0);						//1->clear adc interrupt flag
	
	tmp = ADC->DR;							//read the adc value
	ADC->ANA_CR&=~(1<<0);					//1->enable adc ldo, 0->disable adc ldo
	//needs to do conversion - datasheet not clear
	//tmp ^= 0x20000ul;						//flip the highest bit (bit 18)
	if (tmp & 0x20000ul) tmp = tmp & 0x1fffful; else tmp |=0x20000ul;
	//ADC->ANA_CR |= (1<<2);				//pd_sdadc: 0->enable, 1->disable
	return tmp;
}

//calibarte adc offset
//average over N runs - N should be power of 2
uint32_t adcReadN(uint8_t ch, uint8_t N) {
	uint32_t tmp=0, avg=0;
	
	for (avg=0, tmp=0; tmp<N; tmp++) avg+=adcRead(ch);
	return avg /= N;				//return the average over 8 runs
}

//read vtemp: a very convoluted process, per the datasheet
//reading returned here is 16x that in the datasheet
//8x oversampling
//calibration: 
//1. 74180@65.5F/18.6C
//2. 74300@66.2F/
//3. 74330@66.4F/
//4. 74500@66.9F/
//5. 74800@68.0F/
int32_t adcReadTempx16(void) {
	uint32_t code_out1, code_out2;
	
	adcSetGain(PGAx4);						//set gain to 4x
	ADC->TEMP_CR = 	(0 << 4) |				//temp gain. 0->2x, 1->4x, 2->6x, 3=8x
					(0 << 1) |				//temp calib bit, 0->for code_out1, 1->for code_out2
					(1 << 0) |				//1->enable the temp module, 0->disable the temp module
					0x00;
	code_out1 = adcReadN(ADC_TEMP, 8);		//read code_out1.
	ADC->TEMP_CR = 	(0 << 4) |				//temp gain. 0->2x, 1->4x, 2->6x, 3=8x
					(1 << 1) |				//temp calib bit, 0->for code_out1, 1->for code_out2
					(1 << 0) |				//1->enable the temp module, 0->disable the temp module
					0x00;
	code_out2 = adcReadN(ADC_TEMP, 8);		//read code_out2.
	
	//disable the temp module
	ADC->TEMP_CR&=~(1<<0);					//1->enable the temp module, 0->disable the temp module
	return code_out1 - code_out2;			//reading is 16x Vtemp shown in the datasheet
}

#define ADC2mv(adc)			((int32_t) (adc) / 4 * 685/10000)		//first formula
//#define ADC2mv(adc)			((int32_t) (adc) / 4 * 1011/2/10000)	//second formula
//read the chip's own power supply / Vcc, in mv: a very convoluted process, per the datasheet
//8x oversampling
//per datasheet: 
//Vcc = (codeout - offset)*68.5uv/2 + 1.2v, codeout and offset in 16 bit form, or
//Vcc = (codeout - offset) * 685 / 20000 + 1200, in mv
//Note to self: I think 1200mv here is wrong. it should be 1311mv (=default Vcmin)
//Vcc = 2.389v using 1200mv, and 2.500v (=LDO output voltage) using 1311mv (=default Vcmin)
uint32_t adcReadVcc(void) {
	uint32_t offset, codeout;
	
	adcSetGain(PGAx2);						//set the gain to 2x
	offset = adcOffset(8);					//read the offset, 
	codeout= adcReadN(ADC_VLDO, 8);			//read the adc_comp
	//return (codeout - offset) * 685 / 20000 + Vcmx1k();	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
	return ADC2mv(codeout - offset) * 4 / 2 + Vcmx1k();	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
}

//deprecated
//read analog input
//return in mv
//gain fixed at 2x
 int32_t adcReadmv0(uint8_t ch) {
	uint32_t offset, codeout;
	
	adcSetGain(PGAx2);						//set the gain to 2x
	offset = adcOffset(8);					//read the offset, 
	codeout= adcReadN(ch, 8);				//read the adc_comp
	//code uses a slope of LSB = (126364/1000.0), constant of 1196, on 16-bit results
	//return (int32_t) (codeout - offset) / 4 * 685 / 20000 + Vcmx1k();	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
	return ADC2mv(codeout - offset) / 2 + Vcmx1k();
}

//read analog input
//return in mv
//user specified gain
 int32_t adcReadmv(uint8_t ch, uint8_t gain) {
	uint32_t offset, codeout;
	 int32_t tmp;
	
	adcSetGain(gain);						//set the gain to 2x
	offset = adcOffset(8);					//read the offset, 
	codeout= adcReadN(ch, 8);				//read the adc_comp
	tmp = ADC2mv(codeout - offset);	//tmp = (int32_t) (codeout - offset) / 4 * 685 / 10000;
	switch (gain) {
		case PGAx1   : tmp /= 1   ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx2   : tmp /= 2   ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx3   : tmp /= 3   ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx4   : tmp /= 4   ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx16  : tmp /= 16  ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx32  : tmp /= 32  ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx48  : tmp /= 48  ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx64  : tmp /= 64  ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx96  : tmp /= 96  ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx128 : tmp /= 128 ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx192 : tmp /= 192 ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx256 : tmp /= 256 ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx384 : tmp /= 384 ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx512 : tmp /= 512 ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx768 : tmp /= 768 ; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
		case PGAx1024: tmp /= 1024; break;	//return in mv, using default Vcmin of 1311mv, vs. 1200mv per datasheet vs. 1196mv per code
	}
	switch (ch) {
		//add back Vcm for single ended channels
		case ADC_CH0:
		case ADC_CH1:
		case ADC_CH2:
		case ADC_CH3:
		case ADC_VLDO:
		case ADC_TEMP:
		case ADC_OFST:
			tmp+= Vcmx1k();					//add the offset for single ended channels
			break;
	}
	return tmp;
}

//generate 4-bit random numbers
uint8_t arand4(void) {
	uint8_t tmp=arand1();
	
	//tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	return tmp;
}

//generate 8-bit random number
uint8_t arand8(void) {
	return (arand4() << 4) | arand4();
}

