dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//return 16-bit random number
uint16_t arand16(void) {
	return ((uint16_t) arand8() << 8) | arand8();
}


//return 32-bit random number
uint32_t arand32(void) {
	return ((uint32_t) arand16() << 16) | arand16();
}

//end adc

//touch
//initialize touch sensors
void TSInit(void) {
	//enable clock
	RCC->CLK_EN |= (1<<21);					//1->enable touch sensors, 0->disable touch sensors. bit 21 = touch sensors
	
	TOUCH->CR =		(10 <<26) |				//scan period, in 16ms. 0..0x3f. default 10
					(20 <<20) |				//capdet windows. 2..3f. default 20
					(0  << 4) |				//touch sensor, 0x0000..0xffff
					(0  << 0) |				//1->enable touch, 0->disable touch
					0x00;

	//configure interrupt
	TOUCH->IE_IF = 	0xffff;					//ie (31.16): 0->disable interrupt, 1->enable interrupt. if (15..0): write 1 to clear
	
	//NVIC_SetPriority(TOUCH_IRQn, 0);		//set priority
	NVIC_ClearPendingIRQ(TOUCH_IRQn);		//clear pending flag
	NVIC_DisableIRQ(TOUCH_IRQn);			//disable the interrupt

	TOUCH->CR|=		(1  << 0);				//1->enable touch, 0->disable touch
}

//set threshold. default = 50
void TSSetTHS(PIN_TypeDef pin, uint8_t ths) {
	ths = ths & 0x3f;									//0..63
	//configure touch registers / pins (afio opt7)
	switch (pin) {
		case PA0: TOUCH->CH0CR = (TOUCH->CH0CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA1: TOUCH->CH1CR = (TOUCH->CH1CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA2: TOUCH->CH2CR = (TOUCH->CH2CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA3: TOUCH->CH3CR = (TOUCH->CH3CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA4: TOUCH->CH4CR = (TOUCH->CH4CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA5: TOUCH->CH5CR = (TOUCH->CH5CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA6: TOUCH->CH6CR = (TOUCH->CH6CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA7: TOUCH->CH7CR = (TOUCH->CH7CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA8: TOUCH->CH8CR = (TOUCH->CH8CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA9: TOUCH->CH9CR = (TOUCH->CH9CR &~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA10:TOUCH->CH10CR= (TOUCH->CH10CR&~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA11:TOUCH->CH11CR= (TOUCH->CH11CR&~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA12:TOUCH->CH12CR= (TOUCH->CH12CR&~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA13:TOUCH->CH13CR= (TOUCH->CH13CR&~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA14:TOUCH->CH14CR= (TOUCH->CH14CR&~0x3f) | ths; pinAFIO(pin, 7); break;
		case PA15:TOUCH->CH15CR= (TOUCH->CH15CR&~0x3f) | ths; pinAFIO(pin, 7); break;
		default: break;	//do nothing
	}
}

//get threshold. default = 50
uint8_t TSGetTHS(PIN_TypeDef pin) {
	uint8_t ths=0;									//0..63
	switch (pin) {
		case PA0:  ths = TOUCH->CH0CR ; break;
		case PA1:  ths = TOUCH->CH1CR ; break;
		case PA2:  ths = TOUCH->CH2CR ; break;
		case PA3:  ths = TOUCH->CH3CR ; break;
		case PA4:  ths = TOUCH->CH4CR ; break;
		case PA5:  ths = TOUCH->CH5CR ; break;
		case PA6:  ths = TOUCH->CH6CR ; break;
		case PA7:  ths = TOUCH->CH7CR ; break;
		case PA8:  ths = TOUCH->CH8CR ; break;
		case PA9:  ths = TOUCH->CH9CR ; break;
		case PA10: ths = TOUCH->CH10CR; break;
		case PA11: ths = TOUCH->CH11CR; break;
		case PA12: ths = TOUCH->CH12CR; break;
		case PA13: ths = TOUCH->CH13CR; break;
		case PA14: ths = TOUCH->CH14CR; break;
		case PA15: ths = TOUCH->CH15CR; break;
		default: break; //do nothing
	}
	return ths & 0x3f;
}

//enable touch on a pin
void TSEnable(PIN_TypeDef pin) {
	//ths = ths & 0x3f;									//0..63
	if ((pin >= PA0) && (pin <= PA15)) {				//touch pins are pa0..15
		pinTouch(pin);									//change pin setting
		//TOUCH->CH0CR = (TOUCH->CH0CR &~0x3f) | ths; 	//set touch thresholds
		TOUCH->CR |= GPIO_PinDef[pin].mask;				//add pin to scan
	}
}
//end touch

//lcd
//initialize lcd
void LCDInit(void) {
	//enable clock
	RCC->CLK_EN |= (1<<14);					//1->enable lcd, 0->disable lcd. bit 14 = lcd
}
//end lcd

//spi
//initialize spi
void spiInit(void) {
	//enable clock
	RCC->CLK_EN |= (1<<7);					//1->enable clock, 0->disable clock. bit 7 = spi
	
	//disable interrupts
	NVIC_ClearPendingIRQ(SPI_LS_IRQn);		//clear pend flag
	//NVIC_SetPriority(SPI_LS_IRQn, 0);		//set the priority
	NVIC_DisableIRQ(SPI_LS_IRQn);			//disable the irq

	//disable spi
	SPI->CH_CFG&=~(1<<0);					//1->enable spi, 0->disable spi
	//configure spi
	SPI->CH_CFG = 	(0 << 23) |				//invalid bits
					(1 << 22) |				//1->clear fifo, 0->no effect
					(0 << 21) |				//1->continous mode, 0->transmit only if fifo has data (default)
					(0 << 20) |				//1->enable rx, 0->disable rx
					(1 << 19) |				//1->enable tx, 0->disable tx
					(8 <<  3) |				//bit length. bit 18..3
					(0 <<  2) |				//1->spi_cs effective high, 0->spi_cs effective low
					(1 <<  1) |				//1->spi_cs software controlled, 0->spi_cs hardware controlled
					(0 <<  0) |				//1->enable spi, 0->disable spi
					0x00;
	SPI->SPI_CFG=	(0b00 << 17) |			//spi format: 0b00->motorolla, 0b01->TI, 0b10->microwire, 0b11->reserved
					(1 << 16) |				//1->spi pin always driven, 0->spi pin tri-stated
					(0 << 12) |				//spi_cs hold time post transmission, 0..7, in APB clock cycles (0..127)
					(0 <<  9) |				//spi_cs hold time before transmission, 0..7, in APB clock cycles (0..127)
					(0 <<  7) |				//spi output delay, 0..3, in APB clock cycles
					(0 <<  4) |				//frame delay (in between spi_cs edges). 0..7, in APB clock cycles (0..127)
					(0 <<  3) |				//0->least significant bit first, 1->most significant bit first
					(1 <<  2) |				//1->this device is a master, 0->this device is a slave
					(0 <<  1) |				//spi phase: 1->phase A, 0->phase b
					(0 <<  0) |				//spi polarity: 1->sck idles high, 0->sck idles low
					0x00;
	SPI->CLK_CFG=	(F_PHB / F_SPI / 2 - 1) & 0xffff;	//set up the clock divider. 16 bits wide
	SPI->MODE_CFG=	(4 << 6) |				//rx int / dma threshold: if rx fifo has more data than specified here. 0..7
					(4 << 2) |				//tx int / dma threshold: if tx fifo has more data than specified here. 0..7
					(0 << 1) |				//1->rx dma on, 0->rx dma off
					(0 << 0) |				//1->tx dma on, 0->tx dma off
					0x00;
	SPI->INT_MASK=	(1 << 7) |				//spi timeout: 0->allows interrupts, 1->disallows interrupts
					(1 << 6) |				//spi done: 0->allows interrupts, 1->disallows interrupts
					(1 << 5) |				//spi rx overrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 4) |				//spi rx underrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 3) |				//spi tx overrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 2) |				//spi tx underrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 1) |				//spi rx fifo ready: 0->allows interrupts, 1->disallows interrupts
					(1 << 0) |				//spi tx fifo ready: 0->allows interrupts, 1->disallows interrupts
					0x00;
	//write 1 to clear
	SPI->INT_SRC=	(1 << 7) |				//spi timeout: 0->allows interrupts, 1->disallows interrupts
					(1 << 6) |				//spi done: 0->allows interrupts, 1->disallows interrupts
					(1 << 5) |				//spi rx overrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 4) |				//spi rx underrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 3) |				//spi tx overrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 2) |				//spi tx underrun: 0->allows interrupts, 1->disallows interrupts
					(1 << 1) |				//spi rx fifo ready: 0->allows interrupts, 1->disallows interrupts
					(1 << 0) |				//spi tx fifo ready: 0->allows interrupts, 1->disallows interrupts
					0x00;
	SPI->TRANS_MODE=(8 <<24) |				//transmission block length. 4..32 bits
					(0 <<16) |				//1->allows microburst, 0->does not allow microburst
					(8 << 8) |				//microwire block length under microburst. 1..32 bits
					(8 << 0) |				//microwire command length, 1..32 bits
					0x00;
	//SPI->SLV_LEN=	0x00;					//slave length - set to default
	//enable spi
	SPI->CH_CFG |=	(1 <<  0);				//1->enable spi, 0->disable spi
	
	//enable the pins
#if defined(SPISCK2PIN)
	SPISCK2PIN();
#endif

#if defined(SPIMOSI2PIN)
	SPIMOSI2PIN();
#endif

#if defined(SPIMISO2PIN)
	SPIMISO2PIN();
#endif
}

//transmit a byte
uint8_t spiWrite(uint8_t dat) {
	spiWait();								//wait if the tx buffer is full
	SPI->TXDATA = (dat);					//transmit a byte
	return SPI->RXDATA;						//return received data
}

//transmit a buffer
void spiWrites(uint8_t *dat, uint32_t bytes) {
	uint8_t *tmp=dat;
	while (bytes--) spiWrite(*tmp++);
}

//end spi

