dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//i2c
#define I2CWait()		while (I2C->CR_SR & (1<<1)) continue	//wait for i2c transmission to end
//initialize i2c
void i2cInit(void) {
	//enable clock
	RCC->CLK_EN |= (1<<0);						//1->enable clock, 0->disable clock. bit 0 = i2c

	//disable interrupts
	NVIC_ClearPendingIRQ(I2C_IRQn);				//clear pend flag
	//NVIC_SetPriority(I2C_IRQn, 0);			//set the priority
	NVIC_DisableIRQ(I2C_IRQn);					//disable the irq

	//disable i2c
	I2C->EN &=~(1<<7);							//1->enable i2c, 0->disable i2c
	
	//configure i2c
	//configure the clock
	I2C->PRESCALE_L = ((F_PHB / F_I2C - 1) >> 0) & 0xff;
	I2C->PRESCALE_H = ((F_PHB / F_I2C - 1) >> 8) & 0xff;
	/****** write 1 to disable interrupt on bit 6*******/
	I2C->EN |= (1<<6);							//1->disable interrupt, 0->enable interrupt
	
	//enable i2c
	I2C->EN |= (1<<7);							//1->enable i2c, 0->disable i2c
	
	//enable the pins
#if defined(I2CSCL2PIN)
	I2CSCL2PIN();
#endif

#if defined(I2CSDA2PIN)
	I2CSDA2PIN();
#endif
}

//send a stop condition
uint8_t i2cStop(void) {
    I2C->CR_SR = (1<<6);
    I2CWait();									//while (I2C->CR_SR & I2C_SR_TIP) continue;
	return I2C->CR_SR & (1<<1);
}

//write one byte to slave
uint8_t i2cWrite(uint8_t dat, uint8_t ifstart) {
	I2C->DATA = dat;							//load the data
	I2C->CR_SR = ((ifstart)?(1<<7):0) | (1<<4);
	I2CWait();									//while (I2C->CR_SR & I2C_SR_TIP) continue;	//wait for the transmission to complete
	return (I2C->CR_SR & (1<<7))?I2C_ACK:I2C_NOACK;	//return ack/noack status
}

//write multiple bytes byte to slave
uint8_t i2cWrites(uint8_t devaddr, uint8_t regaddr, uint8_t *dat, uint32_t bytes) {
	uint8_t *tmp=dat;
	if (i2cWrite(devaddr & 0xfe, 1) == I2C_NOACK) return i2cStop();
	if (i2cWrite(regaddr       , 0) == I2C_NOACK) return i2cStop();
	while (bytes--) i2cWrite(*tmp++, 0);
	i2cStop();
	return 0;
}

//read one byte from slave
uint8_t i2cRead(uint8_t ack_noack, uint8_t ifstop) {
	uint8_t tmp=0;
	tmp |= (ack_noack == I2C_ACK)?(1<<3) :0;
	tmp |= (ifstop              )?(1<<6):0;
	I2C->CR_SR = tmp;							//write to cr/sr
	I2CWait();									//while (I2C->CR_SR & I2C_SR_TIP) continue;	//wait for the transmission to complete
	return I2C->DATA;							//return the data
}

//read multiple bytes from slave
uint8_t i2cReads(uint8_t devaddr, uint8_t regaddr, uint8_t *dat, uint32_t bytes) {
	uint8_t *tmp=dat;
	if (i2cWrite(devaddr & 0xfe, 1) == I2C_NOACK) return i2cStop();
	if (i2cWrite(regaddr       , 0) == I2C_NOACK) return i2cStop();
	//restart
	if (i2cWrite(devaddr | 0x01, 1) == I2C_NOACK) return i2cStop();
	while (bytes--) if (bytes==1) *tmp++= i2cRead(I2C_ACK, 1); else *tmp++ = i2cRead(I2C_NOACK, 0);
	return 0;
}

//end i2c

//software i2c
#define sI2C_HIGH(pin)				do {                        pinMode(pin, INPUT);  sI2C_DLY();} while (0)	//let pin float to high
#define sI2C_LOW(pin)				do {digitalWrite(pin, LOW); pinMode(pin, OUTPUT); sI2C_DLY();} while (0)	//pull pin low
#define sI2C_GET(pin)				digitalRead(pin)			//read a pin
#define sI2C_DLY()					delayTks(F_CPU / F_sI2C / 4)								//software I2C delay for half of the period to achieve F_sI2C

//initialize i2c
void sI2CInit(void) {
	//pins idle high / as input
	sI2C_HIGH(sI2CSDAPIN); sI2C_HIGH(sI2CSCLPIN);				//clear the bus (idles high)
}


//-----------------START Condition-----------------------
void sI2CStart(void) {
	sI2C_HIGH(sI2CSDAPIN);						//let sda high
	sI2C_HIGH(sI2CSCLPIN);						//let scl high
	sI2C_LOW(sI2CSDAPIN);						//pull i2c_sda low
	sI2C_LOW(sI2CSCLPIN);						//pull i2c_scl low
}

//------------------STOP Condition--------------------------
void sI2CStop(void) {
	sI2C_LOW(sI2CSCLPIN);						//let scl float high
	sI2C_LOW(sI2CSDAPIN);
	sI2C_HIGH(sI2CSCLPIN);						//let scl float high
	sI2C_HIGH(sI2CSDAPIN);						//let sda  high
}

//------------------restart condition---------------------

//-------------------I2C Write---------------------------
uint8_t sI2CWrite(uint8_t dat) {
	unsigned char i;

	sI2C_HIGH(sI2CSDAPIN);						//let sda float
	i=0x80;
	do {
		sI2C_LOW(sI2CSCLPIN);					//clear i2c_scl
	  	if(dat & i)
			{sI2C_HIGH(sI2CSDAPIN);}			//set i2c_sda
		else
			{sI2C_LOW(sI2CSDAPIN);}				//clear i2c_sda
		sI2C_HIGH(sI2CSCLPIN);					//set i2c_scl
	  	i = i >> 1;								//shift out the highest bit
	} while (i);
	sI2C_LOW(sI2CSCLPIN);						//clear i2c_scl

	sI2C_HIGH(sI2CSDAPIN);						//float sda, let the slave control it
	sI2C_HIGH(sI2CSCLPIN);
	i=0;
	while (sI2C_GET(sI2CSDAPIN)&&(i<I2C_ACK_ERROR))
		i++;									//wait for ack from the slave (ack = sda pulled to low by the slave
	sI2C_LOW(sI2CSCLPIN);
	if (i<I2C_ACK_ERROR) return I2C_ACK;		//no trouble
	else return I2C_NOACK;						//trouble! ack timed out
}

//-----------------------i2c read------------------------------
//to be consistent with i2c protocol, use negative logic
//ack = 0 -> send ack
//ack = 1 -> no ack
uint8_t sI2CRead(uint8_t ack) {
	unsigned char i, data_t=0;

	sI2C_HIGH(sI2CSDAPIN);						//let sda float
	i=0x80;
	do {
		sI2C_LOW(sI2CSCLPIN);					//clear i2c_scl
		data_t <<=1;							//left shift the data
		i = i >> 1;
		//i2c_delay(0); i2c_delay(0);i2c_delay(0);i2c_delay(0);
		sI2C_HIGH(sI2CSCLPIN);					//let scl float to high
		if (sI2C_GET(sI2CSDAPIN)) data_t |= 0x01;	//set the last bit high
		else data_t |= 0x00;
		//i2c_delay(0);
	} while (i);
	sI2C_LOW(sI2CSCLPIN);						//pull scl low
	if (ack==I2C_ACK)
		{sI2C_LOW(sI2CSDAPIN);}					//send ack
	else
		{sI2C_HIGH(sI2CSDAPIN);}				//send no-ack
	sI2C_HIGH(sI2CSCLPIN);						//send ack/no-ack
	sI2C_LOW(sI2CSCLPIN);
	return data_t;
}

//write from a buffer
uint8_t sI2CWrites(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite) {
	sI2CStart();							//send start condition
	sI2CWrite(DeviceAddr | I2C_CMD_WRITE);	//send device addr, for write operations
	sI2CWrite(RegAddr);					//send register addr
	while (NumByteToWrite) {
		sI2CWrite(*pBuffer);				//send data
		pBuffer++;							//increment buffer pointer
		NumByteToWrite--;					//decrement counter
	}
	sI2CStop();							//send stop condition
	return 0;								//indicating success
}

