dannyf00/Arduino-Clone-for-W801-W806/w801duino.c
//read to a buffer
uint8_t sI2CReads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead) {
	sI2CStart();							//send start condition
	sI2CWrite(DeviceAddr | I2C_CMD_WRITE);	//send device addr, for write operations
	sI2CWrite(RegAddr);					//send register addr
	sI2CStart();							//send restart
	sI2CWrite(DeviceAddr | I2C_CMD_READ);	//send device addr, for read operations
	while (NumByteToRead) {
		if (NumByteToRead==1) {
			*pBuffer=sI2CRead(I2C_NOACK);
			sI2CStop();							//send the stop condition
			break;
		}
		*pBuffer=sI2CRead(I2C_ACK);		//read the data
		pBuffer++;							//increment buffer
		NumByteToRead--;					//decrement count
	}
	return 0;
}

//end software i2c

//true random number generator
//initialize the 32-bit random number generator
//the following must be true:
//  CP bits: 1..7
//  digital post processing enabled: bit 2 = 0
//  generate true random numbers: bit 1 = 1
void trngInit(void) {
	//enable the lock
	RCC->CLK_EN |= 1<<17;				//1->enable clock to gpsec, 0->disable clock to gpsec
	
	//seed the generator
	GPSEC->KEY0 = 31415926ul;			//just some random numbers
	//disable the trng module
	//GPSEC->TRNG_CR &=~(1<<0);			//1->enable the trng module, 0->disable the trng module
	GPSEC->TRNG_CR =	(4<<3) |		//CP - not sure what this is. W801 demo used this value (4). 1..7 valid values
						(0<<2) |		//0->enable digital post process, 1->disable digital post process
						(1<<1) |		//0->produce pseudo random numbers, 1->produce true random numbers
						(1<<0) |		//1->enable the trng module, 0->disable the trng module
						0x00;
	//now trng is running
}

//random number generator
//initialize the 32-bit pseudo random number generator
//the following must be true:
//  CP bits: 1..7
//  digital post processing enabled: bit 2 = 0
//  generate pseudo random numbers: bit 1 = 0
void prngInit(void) {
	//enable the lock
	RCC->CLK_EN |= 1<<17;				//1->enable clock to gpsec, 0->disable clock to gpsec
	
	//seed the generator
	GPSEC->KEY0 = 0x31415926ul;			//just some random numbers
	GPSEC->CFG =	(1<<30) |			//1->enable rng, 0->disable rng
					(1<<29) |			//1->load the seed, 0->use 0 as seed
					(1<<28) |			//1->32 bit rng, 0->16bit rng
					0x00;
	//disable the trng module
	//GPSEC->TRNG_CR &=~(1<<0);			//1->enable the trng module, 0->disable the trng module
	GPSEC->TRNG_CR =	(4<<3) |		//CP - not sure what this is. W801 demo used this value (4). 1..7 valid values
						(0<<2) |		//0->enable digital post process, 1->disable digital post process
						(0<<1) |		//0->produce pseudo random numbers, 1->produce true random numbers
						(1<<0) |		//1->enable the trng module, 0->disable the trng module
						0x00;
	//now prng is running
}

//end trng

//circular buffer
//global defines
#define cBUFF_SIZE_MASK 	(cBUFF_SIZE-1U)		//mask

//global variables
//reset the cbuffer
void cbInit(CB_TypeDef *cbuffer) {
	cbuffer->writeIndex = cbuffer->readIndex = -1;
}

//returns true if cbuffer is empty
char cbEmpty(CB_TypeDef *cbuffer) {
	return (cbuffer->writeIndex & cBUFF_SIZE_MASK) == (cbuffer->readIndex & cBUFF_SIZE_MASK);
}

//returns true if cbuffer is full;
char cbFull(CB_TypeDef *cbuffer) {
	return ((cbuffer->writeIndex + 1) & cBUFF_SIZE_MASK) == (cbuffer->readIndex & cBUFF_SIZE_MASK);
}

//write to the buffer - needs to test if the buffer is full before writing to it
cbuffer_t cbWrite(CB_TypeDef *cbuffer, cbuffer_t dat) {
	cbuffer->buffer[(++cbuffer->writeIndex) & cBUFF_SIZE_MASK] = dat;
	return dat;
}

//read from the buffer - needs to test if the buffer is empty before reading from it
cbuffer_t cbRead(CB_TypeDef *cbuffer) {
	return cbuffer->buffer[(++cbuffer->readIndex) & cBUFF_SIZE_MASK];
}

//write string to CB
void str2cb(CB_TypeDef *cb, char *str) {
	while (!cbFull(cb) && (*str)) cbWrite(cb, *str++);
}

//write CB to string
void cb2str(char *str, CB_TypeDef *cb) {
	while (!cbEmpty(cb)) *str++=cbRead(cb);
}


//end circular buffer

//input capture - untested
//initialize input capture on pwm0
void ic0Init(void) {
	pwm0Init();						//initialize pwm0
	PWM->CR |= (1<<24);			//1->enable capture on pwm0, 0->disable capture
	
	//disable interrupt
}

//initialize input capture on pwm4
void ic4Init(void) {
	pwm4Init();						//initialize pwm4
	PWM->CH4CR2 |= (1<<1);			//1->enable capture on pwm4, 0->disable capture
	
	//disable interrupt
}

//end input capture

//fake fputc, if you want to to exclude libc_port.c 
//this reduces the size significantly (13KB+ footprint)
//if you use libc_port.c in the build, this version will be overwritten
__attribute__((weak)) int fputc(int ch, FILE *stream) {
    (void)stream;
    uart0Put(ch);						////sendchar(ch);
	return 0;
}
//end fake fputc

//end

